#  Python with MySQL

In [15]:
import mysql.connector
from mysql.connector import errorcode, connect

## Connect to database

In [84]:
try:
    db = connect(
        user = 'root',
        password = '',
        host = 'localhost',
        database = 'ds_dataset'
    )
except mysql.connector.Error as e:
    if e.errno == errorcode.ER_ACCESS_DENIED_ERROR:
        print("Access denied !")
    elif e.errno == errorcode.ER_BAD_DB_ERROR:
        print("Database not exists")
    else:
        print(e)

cursor = db.cursor(buffered=True)

In [17]:
cursor.execute('DROP TABLE IF EXISTS Employee') # delete table if exists

In [18]:
cursor.execute("""
CREATE TABLE Employee (
    id INT PRIMARY KEY AUTO_INCREMENT,
    name VARCHAR(200),
    salary DOUBLE
)
""")

## Insert

In [19]:
sql = "INSERT INTO Employee (name, salary) VALUES \
('Houari', 1000);"
cursor.execute(sql)
db.commit()

In [20]:
name = 'Mohammed'
salary = 350.0

cursor.execute("INSERT INTO Employee (name, salary) VALUES ('%s', '%d');" % (name, salary))
db.commit()

In [21]:
def insertData(sql):
    try:
        cursor.execute(sql)
        db.commit()
    except:
        db.rollback()

sql = 'INSERT INTO Employee (name, salary) VALUES ("Ali", 250);'
insertData(sql)

In [45]:
data = {
    0: {
        'name':'Omar',
        'salary':100.0
    },
    1: {
        'name':'Khaled',
        'salary':150.0
    },
    2: {
        'name':'Zakaria',
        'salary':180.50
    }
}
# Insert collection (list) to database
for i in data:
    sql = "INSERT INTO Employee (name, salary) VALUES ('%s', '%d');" % (data[i]['name'], data[i]['salary'])
    insertData(sql)

## Select

In [52]:
def retrieveData(sql):
    try:
        cursor.execute(sql)
        return cursor.fetchall()
    except:
        db.rollback()

In [67]:
sql = 'SELECT * FROM Employee WHERE salary > 100;'
retrieveData(sql)

[(1, 'Houari', 1050.0),
 (2, 'Mohammed', 350.0),
 (3, 'Ali', 250.0),
 (5, 'Khaled', 150.0),
 (6, 'Zakaria', 180.0),
 (8, 'Khaled', 150.0),
 (9, 'Zakaria', 180.0)]

## Update

In [66]:
sql = "UPDATE Employee SET salary = salary + 50 WHERE name = 'Houari';" # add 50 to solde of employee Houari
insertData(sql)

## Delete

In [68]:
sql = "DELETE FROM Employee WHERE name = 'Khaled';" # add 50 to solde of employee Houari
insertData(sql)

In [69]:
db.close() # close connection